{
  "basics": {
    "name": "Taher Barakat",
    "label": "Software Developer",
    "email": "taber.barakat12223@gmail.com",
    "phone": "+963938907414",
    "website": "https://taherbarakat.github.io/portfolio",
    "summary": "Software Developer with 3+ years of professional experience at Syriatel Mobile Telecom, specializing in Angular and .Net development and responsive web applications. Skilled in building reusable components, implementing state management, and API integration, with a commitment to writing clean, maintainable code.",
    "location": {
      "city": "Damascus",
      "country": "Syria"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/taher-barakat/"
      },
      {
        "network": "GitHub",
        "url": "https://github.com/TaherBarakat"
      }
    ]
  },
  "work": [
    {
      "company": "Syriatel Mobile Telecom",
      "position": "Software Developer",
      "startDate": "02/2023",
      "endDate": "Present",
      "location": "Damascus",
      "highlights": [
        "Maintain and enhance reporting systems related to sales, ensuring accuracy, efficiency, and scalability.",
        "Collaborate on the development and optimization of systems built using Angular and .NET Core to support sales reporting and analysis.",
        "Gathering data from many sources and applying classification on it to facilitate and standardize reporting.",
        "Make dynamic dashboards related to business scope.",
        "Initiate special analysis reports and studies that reflect sales and marketing information analysis points of view.",
        "Provide the concerned department with the requested reports using the latest available techniques.",
        "Provide internal customers in MIS Management Information System with the list of eligible subscribers to certain offers.",
        "Conduct pre-offer studies to locate segments of subscribers, spot market opportunities, and possible chances and risks.",
        "Manage offers behavior from the database side (find eligibility and its segmentation depending on specific criteria).",
        "Prepare yearly revenue budget template to gather all the necessary inputs from the Marketing Department and apply logical evaluation to issue yearly revenue budget."
      ]
    }
  ],

  "projects": [
    {
      "name": "Sales Reporting System (SRS)",
      "description": "Daily and monthly sales performance reporting system for dealers and sub-dealers network.",
      "highlights": [
        "Generates tabular reports with sales metrics (new lines, revenue, goal achievement) and provides comparative analysis of dealer/sub-dealer performance.",
        "Organizes sales data by teams and regions for targeted performance review.",
        "My participation in SRS was implementing a mail service that allows users to customize report parameters and scheduling based on individual preferences."
      ],
      "keyFeatures": [
        "Dealer hierarchy visualization",
        "Goal tracking dashboards",
        "Performance trend analysis"
      ]
    },
    {
      "name": "Corporate Reporting System (CRS)",
      "description": "Corporate/VIP customer activity reporting platform.",
      "highlights": [
        "Tracks corporate line activations, offer subscriptions, and usage patterns also provides segmented views of VIP customer activities.",
        "Delivers standardized monthly reports for corporate account management and consolidates data from multiple billing systems into unified reports."
      ],
      "keyFeatures": [
        "Corporate segment classification",
        "Offer activation tracking",
        "Consumption pattern analysis"
      ]
    },
    {
      "name": "Product Monitoring System (PMS)",
      "description": "Marketing product performance analysis tool with historical data.",
      "highlights": [
        "Tracks subscriber counts and revenue per offer/bundle.",
        "Provides monthly activation trends through comparative charts.",
        "Enables product classification analysis (prepaid/postpaid, segment-based).",
        "Supports marketing decisions with historical performance data.",
        "I built an admin tool for supervisors to manage roles, control table content and behavior, and modify queries/conditions dynamically."
      ],
      "keyFeatures": [
        "Product lifecycle tracking",
        "Activation/revenue trend visualization",
        "Subscriber segmentation reports"
      ]
    }
  ],
  "education": [
    {
      "institution": "Damascus University",
      "area": "Telecommunications & Electronics Engineering",
      "studyType": "Bachelor Degree",
      "startDate": "15/11/2016",
      "endDate": "12/11/2024",
      "location": "Damascus"
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "Proficient in developing modern and efficient web applications using Angular, React.js and .NET Core. Extensive experience in building reusable components for scalable and maintainable code."
    },
    {
      "name": "Version Control",
      "level": "Proficient in utilizing version control systems, particularly Git, for collaborative and streamlined development processes."
    },
    {
      "name": "State Management",
      "level": "Expertise in state management libraries such as Redux, RxJs and NgRx, ensuring efficient data flow and application state control."
    },
    {
      "name": "Responsive Design",
      "level": "Adept at creating responsive and visually appealing user interfaces, ensuring optimal user experience across various devices and screen sizes."
    },
    {
      "name": "API Integration",
      "level": "Skilled in Building and integrating RESTful APIs and third-party services using .Net Core to enhance application functionality and data retrieval."
    },
    {
      "name": "Database Automation",
      "level": "Experienced in developing automated procedures, jobs, and packages using Oracle PL/SQL. Skilled in creating scheduled database jobs, ETL processes, and data transformation routines to streamline reporting workflows and maintain data integrity."
    }
  ],
  "languages": [
    {
      "language": "Arabic",
      "fluency": "Mother Language"
    },
    {
      "language": "English",
      "fluency": "B2"
    },
    {
      "language": "German",
      "fluency": "A1"
    }
  ],
  "certificates": [
    {
      "name": "HTML and CSS in depth",
      "issuer": "Meta/Coursera",
      "date": "12/2018",
      "location": "Online"
    },
    {
      "name": "Programming with JavaScript",
      "issuer": "Meta/Coursera",
      "date": "11/2023",
      "location": "Online"
    },
    {
      "name": "Version Control",
      "issuer": "Meta/Coursera",
      "date": "11/2023",
      "location": "Online"
    },
    {
      "name": "Introduction to Front-End Development",
      "issuer": "Meta/Coursera",
      "date": "10/2023",
      "location": "Online"
    }
  ]
}
